criteria2desc = {
    "Agg_data": "Интегральный критерий",
    "percent_hired_first_year" : "Процент выпускников, устроившхся на работу в топовые места в течении года после "
                                 "выпуска ",
    "cnt_publication_all" : "Количество публикаций работ по данной направлению ОП",
    "percent_autors_programm" : "Процент авторских курсов именитых преподавателей",
    "university_rank" : "Место университета в используемом рейтинге страны",
"GOS_avg" : "Средние значение Государтственного экзамена(Россия),\n или его аналога в других странах",
"Diplom_avg" : "Средняя оценка за защиту диплома",
"number_of_articles" : "Количество научных публикаций от преподавателей направления ОП",
"has_p2p_score" : "Наличие оценки преподователей друг другом для вывода рейтинга среди них",
"has_stud_score" : "Возможность для студентов оценивать преподавателей",
"n_has_phD" : "Количество преподавателей со званиев Профессор на направлении ОП",
"percent_high_qval_teachers " : "Процент преподавателей, проходивших курсы повышения квалификации",
"has_brs" : "Наличие Балльно-Рейтинговой Системы обучения",
"percent_working_student" : "Процент студентов, работающий во время обучения",
"avg_EGE_on_start" : "Среднее количество баллов ЕГЭ(или аналогов для других стран) требуемых для поступления",
"percent_foreign_students" : "Процент иногородних студентов на направлении ОП",
"percent_additional_subjects" : "Количество предметов для самостоятельного(необязательного) обучения, "
                                "которые может предложить данная программа",
"has_partners" : "Есть ли у ВУЗа партнеры со стороны топовых компаних",
"has_eng_disc" : "Есть ли у направления дисциплины на иностранном языке",
"has_word_accred" : "Поддержка ВУЗа мировым сообществом",
"percent_avg_cnt_st_to_all" : "Процент посещаемости предметов на данном направлении",
    "freq_check_knowledge" : "Частота проверки знаний по предмету",
    "avg_salary_new/avg_region_sal": "Отношение средней зарплаты выпускника\n к средней зарплате по региону",
    "percent_teachers_with_hirsh_noless2": "Процент преводавателей на направлении ОП с рейтингом Хирша не менее 2",
    "percent_practic_preps": "Процент преподавателей, ведущих также и практику на факультете",
    "avg_stud_store_per_year": "Средний бал всех студентов за год",
    "p2p_score" : "Средняя оценка преподавателя, рассчитанная на основе его оценок его коллег",
    "student_score":"Средняя оценка преподавателя, рассчитанная на основе оценок его студентов",
    "number_of_articles.teachers.":"Количество статей, выпущенное автором за промежуток времени"

}

translate_criteria = {
"Agg_data": "Интегральный критерий",
"percent_hired_first_year" : "доля_нанятых_первый_год",
    "cnt_publication_all" : "кол-публицаций_университета",
    "percent_autors_programm" : "доля_авторских_программ",
    "university_rank" : "рейтинг_универа",
"GOS_avg" : "среднее_госы",
"Diplom_avg" : "среднее_диплом",
"number_of_articles" : "колво_статей_направление",
"has_p2p_score" : "оценка_препода_преподами",
"has_stud_score" : "оценка_студентами_преподов",
"n_has_phD" : "количество_профессоров",
"percent_high_qval_teachers " : "процент_пов_квалиф",
"has_brs" : "есть_балл_рейт_сис",
"percent_working_student" : "процент_работающих_студентов",
"avg_EGE_on_start" : "среднее_ЕГЭ_поступление",
"percent_foreign_students" : "процент_иногородних_студентов",
"percent_additional_subjects" : "процент_дополнительных_предметов",
"has_partners" : "есть_партнеры",
"has_eng_disc" : "есть_иностранные_дисциплины",
"has_word_accred" : "есть_аккредитация",
"percent_avg_cnt_st_to_all" : "процент_посещаемости",
    "freq_check_knowledge" : "частота_проверки_знаний",
    "avg_salary_new/avg_region_sal": "сред_зп/сред_рег_зп",
    "percent_teachers_with_hirsh_noless2": "процент_преподов_хирш_не_меньше_2",
    "percent_practic_preps": "процент_практиков_преподавателей",
    "avg_stud_store_per_year": "средний_балл_за_год",
    "p2p_score" : "оценка_от_преподавателей",
    "student_score":"оценка_от_студентов",
    "number_of_articles.teachers.":"количество_статей.преподаватель.",

}



save_criteria_tags = {
    "Agg_data": "Изучите графики остальных критериев",
    "percent_hired_first_year":"Один из вариантов решения проблемы - вложить часть бюджета на проведения Дня Карьеры, "
                               "который позволит студентам узнать об актуальных профессиях, а работодателям познакомиться и оценить выпускников",
    "avg_salary_new/avg_region_sal": "Репутация университета испортилась, решение: поощрять публикации преподавателей премиями, выделять гранты студентам, активнее учавствовать в области, отвечающей направлению образовательной программы",
    "student_score": "Один из первых шагов - поговорить с преподавателем, выяснить, что изменилось в сравнении с прошлым годом(семестром), также необходимо встретиться с представителями от лица студентов и выяснить, что является приченой таких действий. После сбора информации постараться решить проблему.",
    "avg_stud_score_per_year": "Первым шагом - просмотреть более подробную информацию, узнать в чем причина по срезами, которые в приложении присутствуют",
    "percent_teachers_with_hirsh_noless2": "Необходимо поддерживать преподавателей в развитии научной карьеры, проводить бонусирование, привлекать студентов и асперантов к научной деятельности",
    "percent_working_student": "Стоит узнать причину того, что студент работает: либо ему не хватает материальных благ, либо учиться ему скучно и хочется узнавать что-то новоее: в первом случае, следует выделить из бюджета средства на поддержку; во втором случае, стоит выяснить нет ли на факультете внеучебных программ, которые были бы интресны студенту, например, научная деятельность"

}


